const prayingMale = [
  {
    "step": "Ният қилиш",
    "text":
        "Намоз вақти киргач, таҳорат билан, пок кийим билан, покиза жойда туриб, "
            "қиблага юзланамиз ва ният қиламиз. Масалан: "
            "\n\n «Холис Аллоҳ учун бомдод намозининг икки ракъат фарзини ўқишга "
            "ният қилдим» \n\nдеган мазмунда ният қиламиз. Имомга иқтидо қилган "
            "киши: \n\n«шу имомга иқтидо қилиб» \n\nдеб ҳам ният қиламиз. Ниятни "
            "пичирлаб, тилда ҳам айтиш мумкин, ичида айтиш ҳам мумкин.",
    "picture": "assets/icons/niyat_qilish.png"
  },
  {
    "step": "Такбири таҳрима",
    "text": "Сўнг:\n\n «Аллоҳу акбар» \n\n деб, қўлнинг бармоқларини ўз ҳолида очиқ тутиб, "
        "қулоқ баробарида кўтарамиз. Кейин ўнг қўлни чап қўлнинг устига қўйиб, "
        "киндик остида боғлаймиз.",
    "picture": "assets/icons/takbir.gif"
  },
  {
    "step": "Қиём",
    "text": "Агар имомга иқтидо қилган бўлсак, «сано» дан бошқа нарсани айтмаймиз."
        "\n\n1.«Субҳанакаллоҳумма ва биҳамдика, ва табарокасмука, ва тааъла жаддука"
        " ва лаа илааҳа ғойрук»."
        "\nСўнгра ичимизда: \n «Аъузу биллаҳи минаш шайтонир рожийм. "
        "Бисмиллаҳир роҳманир роҳийм» ни айтамиз."
        "\nБир ўзимиз ўқиётган бўлсак, Фотиҳа сурасини ўқиймиз."
        "Кейин ичимизда: «Омийн» деймиз."
        "\n\n2. Алҳамду лиллааҳи Роббил ъааламийн."
        "\n3. Ар-роҳмаанир роҳийм."
        "\n4. Маалики явмид-дийн."
        "\n5. Иййаака наъбуду ва иййаака настаъийн."
        "\n6. Иҳдинас-сироотол мустақийм."
        "\n7. Сироотол-лазиина анъамта ъалайҳим ғойрил мағдууби ъалайҳим валад-дооллийн (Omin)."
        "\n\nСуннат, нафл, вожиб намозларнинг ҳар ракъатида, фарз намозларнинг эса биринчи икки ракъатида Фотиҳа сурасидан кейин зам сура, яъни бирор сура ёки узунроқ оят ёки камида учта қисқа оят ўқилади. (Қуйида мисол учун Нас сураси берилди.) \n"
        "\n\n1. Қул аъуузу бирробин-наас."
        "\n2. Маликин-наас."
        "\n3. Илааҳин-наас."
        "\n4. Мин шаррил васваасил хоннаас."
        "\n5. Аллазии йувасвису фии судуурин-наас."
        "\n6. Минал жиннати ван-наас."
        "\n\nФарз намозларнинг учинчи ва тўртинчи ракъатида Фотиҳа сурасидан кейин зам сура ўқилмайди.",
    "picture": "assets/icons/niyat_qilish.png"
  },
  {
    "step": "Рукуъ",
    "text":
        "Фотиҳа ёки зам сурадан кейин такбир айтиб, рукуъга эгиламиз. "
            "\nРукуъда болдирлар тик туради, икки қўл билан тиззаларни чангаллаб турамиз, тиззани букмаймиз, бошни эгмаймиз."
            "\nОрқамиз ҳам текис туриши керак. "
            "\nШу ҳолатда камида уч марта: "
            "\n\n«Субҳаана Роббиял азийм»"
            "\n\nдеймиз.",
    "picture": "assets/icons/ruku.gif"
  },
  {
    "step": "Қиём",
    "text":
        "Намозни ёлғиз ўқиётган бўлсак:"
            "\n\n«Самиъаллоҳу лиман ҳамидаҳ» деб,"
            "\n\nқаддимизни тиклаймиз ва:"
            "\n\n«Роббанаа, лакал ҳамд» деймиз."
            "\n\nЖамоат намозида эса имом:"
            "\n«Самиъаллоҳу лиман ҳамидаҳ» деймиз, иқтидо қилганлар эса ичида:"
            "\n«Роббанаа, лакал ҳамд» дейди.",
    "picture": "assets/icons/qiyom.gif"
  },
  {
    "step": "Сажда",
    "text": "Қаддимизни тўлиқ тиклаб, тик туриб олгач,"
        "\nтакбир айтиб, саждага кетамиз."
        "\nСаждага бораётганида аввал тиззани, кейин қўлни ерга қўямиз, кейин эса икки қўлнинг орасига бошимизни қўямиз.",
    "picture": "assets/icons/sajda.gif"
  },
  {
    "step": "Сажда",
    "text":
        "Саждада турганда қўлнинг бармоқлари қиблага қараб туриши керак."
            "\nПешона билан бурунни ерга теккизамиз, қўлтиқларимиз очилиб туради, қорин сонга тегмай туради."
            "\nОёқ бармоқлари ҳам қиблага қараб туради."
            "\nШу ҳолатда камида уч марта:"
            "\n\n«Субҳаана роббиял аъла» деймиз.",
    "picture": "assets/icons/sajda_wait.gif"
  },
  {
    "step": "Жалса",
    "text":
        "Кейин такбир айтиб, саждадан бошни кўтарамиз ва чап оёқни ётқизи, унинг устига ўтирамиз."
            "\nЎнг оёқ тик ҳолатда қолади, бармоқлари қиблага қараб туради."
            "\nИкки қўлимиз икки тиззанинг устида бўлади.",
    "picture": "assets/icons/jalsa.gif"
  },
  {
    "step": "Сажда",
    "text":
        "Кейин такбир айтиб, иккинчи саждага борамиз ва камида уч марта:"
            "\n\n «Субҳаана роббиял аъла» деймиз.",
    "picture": "assets/icons/sajda.gif"
  },
  {
    "step": "Қиём",
    "text":
        "Яна такбир айтиб, кейинги ракъатга турамиз."
            "\nСаждадан туришда аввал бошни, кейин қўлларни, кейин тиззани кўтарамиз.",
    "picture": "assets/icons/qiyom_turish.gif"
  },
  {
    "step": "Иккинчи ракаъат",
    "text":
        "Иккинчи ракъат ҳам худди биринчи ракъатга ўхшаб ўқилади."
            "\nФақат бошида такбири таҳрима, сано ва «аъузу» айтилмайди."
            "\nФотиҳани ўқиб, сўнг зам сурани ўқиб, такбир айтиб рукуъга эгиламиз."
            "\nКейин туриб, такбир айтиб, икки марта сажда қиламиз.",
    "picture": "assets/icons/ikkinchi_rakat.gif"
  },
  {
    "step": "Қаъда",
    "text": "Иккинчи ракъатнинг иккинчи саждасини қилиб бўлгандан кейин чап оёқ устига ўтирамиз, ўнг оёқнинг бармоқлари қиблага қараб тураверади."
        "\nЎнг қўлни ўнг тизза устига, чап қўлни чап тизза устига, бармоқларни ёйган ҳолда қўямиз."
        "\nКейин ташаҳҳуд ўқийди."
        "\n\n«Аттаҳиййату лиллаҳи вассолавату ваттоййибат. Ассаламу ъалайка аййуҳан-набиййу ва роҳматуллоҳи вабарокатуҳ. Ассаламу ъалайна ва аълаа ибаадиллааҳис солиҳийн. Ашҳаду аллаа илааҳа иллаллоҳу ва ашҳаду анна Муҳаммадан ъабдуҳу ва росулуҳ».",
    "picture": "assets/icons/qada.gif"
  },
  {
    "step": "Салом",
    "text": "Агар намози икки ракъатли бўлса, ташаҳҳуддан кейин салавотларни («Аллоҳумма солли...» ва «Аллоҳумма барик...»ларни) ўқиймиз."
        "\n\n«Аллоҳумма солли ъалаа Муҳаммадив ва ъалаа али Муҳаммад. Кама соллайта ъалаа Иброҳима ва ъалаа али Иброҳим. Иннака ҳамидум мажид."
        "\n\nАллоҳумма барик ъалаа Муҳаммадив ва ъалаа али Муҳаммад. Кама барокта ъалаа Иброҳима ва ъалаа али Иброҳим. Иннака ҳамидум мажид»."
        "\n\nСўнг бошқа дуоларни ўқиб:"
        "\n«Ассалому алайкум ва раҳматуллоҳи» деб, ўнг ва чап томонларига қараб салом берамиз."
        "\n\nАгар намоз уч ёки тўрт ракъатли бўлса, икки ракъатнинг ташаҳҳудини ўқиб бўлиб, "
        "кейин учинчи ракъатга турамиз ва худди иккинчи ракъатга ўхшатиб, намозни давом эттирамиз."
        "\n\nЛекин учинчи ва тўртинчи ракъатларда фақат Фотиҳанинг ўзини ўқиймиз, зам сура ўқимаймиз."
        "\nТўртинчи ракъатнинг иккинчи саждасидан кейин ўтириб, "
        "ташаҳҳуд, салавот ва дуоларни ўқиб, икки томонга салом берамиз.",
    "picture": "assets/icons/salom.gif"
  },
];
